# SlantedColumnTopCutStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlantedColumnTopCutStyle Property
ParameterTypeId Class See Also
---
"Top Cut Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlantedColumnTopCutStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnTopCutStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlantedColumnTopCutStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace